**Полный курс: Теория вероятностей и математическая статистика с нуля до эксперта**  
**Подробные уроки по каждой теме с примерами, кодом и заданиями**

---

### **Уровень 0: Математический фундамент**  
#### **Урок 0.1: Комбинаторика — искусство считать**  
**Цель**: Научиться считать варианты, даже если их миллионы.  

---

**Шаг 1: Правило умножения**  
**Понятие**: Если событие А может произойти `m` способами, а событие В — `n` способами, то оба события вместе — `m × n` способами.  
**Пример**:  
- У вас есть 3 футболки и 2 шорты. Сколько комбинаций нарядов?  
  **Решение**: 3 × 2 = 6.  

**Практика**:  
- Сколько паролей из 3 цифр можно создать? (Ответ: 10 × 10 × 10 = 1000).  

---

**Шаг 2: Перестановки (когда порядок важен)**  
**Понятие**: Число способов упорядочить `n` объектов: `n!` (n-факториал).  
**Пример**:  
- Сколько способов расставить 4 книги на полке?  
  **Решение**: 4! = 4 × 3 × 2 × 1 = 24.  

**Формула**:  
\[ n! = n \times (n-1) \times ... \times 1 \]  

**Практика**:  
- Сколько анаграмм у слова "КОТ"? (Ответ: 3! = 6: КОТ, КТО, ОКТ, ОТК, ТКО, ТОК).  

---

**Шаг 3: Сочетания (когда порядок НЕ важен)**  
**Понятие**: Число способов выбрать `k` объектов из `n` без учёта порядка:  
\[ C(n, k) = \frac{n!}{k! \times (n - k)!} \]  

**Пример**:  
- Сколько способов выбрать 2 книги из 5?  
  **Решение**: C(5, 2) = 10.  

**Практика**:  
- В лотерее 50 билетов, 5 выигрышных. Сколько комбинаций из 2 выигрышных билетов? (Ответ: C(5, 2) = 10).  

**Код**:  
```python
from math import comb
print(comb(5, 2))  # Ответ: 10
```

---

#### **Урок 0.2: Основы анализа — язык математики**  
**Цель**: Понять, как работают пределы, интегралы и ряды.  

---

**Шаг 1: Пределы — приближение к точке**  
**Понятие**: Предел функции при `x → a` — значение, к которому стремится функция.  
**Пример**:  
- \(\lim_{x \to 2} (x + 3) = 5\).  

**Практика**:  
- Чему равен \(\lim_{x \to 0} \frac{\sin(x)}{x}\)? (Ответ: 1).  

---

**Шаг 2: Интегралы — площадь под кривой**  
**Понятие**: Интеграл от функции — площадь между её графиком и осью X.  
**Пример**:  
- Интеграл от \(f(x) = 2x\) от 0 до 2:  
  \[ \int_{0}^{2} 2x \, dx = x^2 \bigg|_{0}^{2} = 4 - 0 = 4. \]  

**Практика**:  
- Чему равен \(\int_{0}^{1} x^2 \, dx\)? (Ответ: \(\frac{1}{3}\)).  

---

**Шаг 3: Ряды — сумма бесконечных чисел**  
**Понятие**: Ряд — сумма членов последовательности.  
**Пример**:  
- Геометрический ряд: \(1 + \frac{1}{2} + \frac{1}{4} + \frac{1}{8} + ... = 2\).  

**Формула**:  
\[ \sum_{n=0}^{\infty} ar^n = \frac{a}{1 - r}, \text{ если } |r| < 1. \]  

**Практика**:  
- Чему равна сумма \(1 + \frac{1}{3} + \frac{1}{9} + \frac{1}{27} + ...\)? (Ответ: \(\frac{3}{2}\)).  

---

### **Уровень 1: Основы вероятности**  
#### **Урок 1.1: Классическая вероятность — от кубиков до лотерей**  
**Цель**: Научиться считать шансы, как профессиональный игрок.  

---

**Шаг 1: Пространство элементарных исходов**  
**Понятие**: Все возможные исходы эксперимента.  
**Пример**:  
- Бросок кубика: {1, 2, 3, 4, 5, 6}.  

**Практика**:  
- Сколько исходов у эксперимента "2 броска монеты"? (Ответ: 4: ОО, ОР, РО, РР).  

---

**Шаг 2: Вероятность события**  
**Понятие**: Вероятность = Число благоприятных исходов / Общее число исходов.  
**Пример**:  
- Вероятность выпадения чётного числа на кубике: 3/6 = 0.5.  

**Формула**:  
\[ P(A) = \frac{\text{Число исходов в А}}{\text{Общее число исходов}} \]  

**Практика**:  
- В колоде 52 карты. Какова вероятность вытащить туза? (Ответ: 4/52 ≈ 0.077).  

---

**Шаг 3: Условная вероятность**  
**Понятие**: Вероятность события А при условии, что произошло событие В.  
**Формула**:  
\[ P(A|B) = \frac{P(A \cap B)}{P(B)} \]  

**Пример**:  
- В коробке 3 красных и 2 синих шара. Вытащили красный шар. Какова вероятность, что следующий шар тоже красный?  
  **Решение**:  
  - После первого красного осталось 2 красных и 2 синих.  
  - Вероятность: 2/4 = 0.5.  

**Практика**:  
- В группе 60% девушек и 40% юношей. 30% девушек знают Python. Какова вероятность, что случайно выбранный человек — девушка, знающая Python? (Ответ: 0.6 × 0.3 = 0.18).  

---

#### **Урок 1.2: Парадоксы — когда интуиция обманывает**  
**Цель**: Понять, почему даже гении ошибаются в вероятностях.  

---

**Шаг 1: Парадокс Монти Холла**  
**Суть**: В игре с 3 дверьми (1 приз, 2 козы) ведущий открывает одну из козьих дверей после вашего выбора. Стоит ли менять дверь?  

**Решение**:  
- Шанс изначально выбрать приз: 1/3.  
- Если поменять выбор: шанс выиграть = 2/3.  

**Код**:  
```python
import random

wins = 0
total = 100000
for _ in range(total):
    doors = [0, 0, 1]  # 0 = коза, 1 = авто
    random.shuffle(doors)
    choice = random.randint(0, 2)
    # Ведущий открывает дверь с козой
    monty = next(i for i in range(3) if i != choice and doors[i] == 0)
    # Меняем выбор
    new_choice = next(i for i in range(3) if i != choice and i != monty)
    if doors[new_choice] == 1:
        wins += 1

print(f"Шанс выиграть при смене двери: {wins / total:.2f}")  # ≈ 0.67
```

**Практика**:  
- Проведите 1000 экспериментов с выбором "не менять дверь". Каков шанс выиграть? (Ответ: ≈ 1/3).  

---

**Шаг 2: Парадокс дней рождений**  
**Вопрос**: Сколько человек нужно, чтобы вероятность совпадения дней рождений была >50%?  

**Ответ**: 23 человека. Вероятность ≈ 50.7%.  

**Формула**:  
\[ P(n) = 1 - \frac{365!}{(365 - n)! \times 365^n} \]  

**Код**:  
```python
def birthday_probability(n):
    prob = 1.0
    for i in range(n):
        prob *= (365 - i) / 365
    return 1 - prob

print(f"Для 23 человек: {birthday_probability(23):.3f}")  # ≈ 0.507
```

**Практика**:  
- Для 40 человек вероятность ≈ 89%. Проверьте это через код.  

---

### **Уровень 2: Случайные величины и распределения**  
#### **Урок 2.1: Дискретные распределения — от монет до Пуассона**  
**Цель**: Научиться моделировать случайные события, как казино.  

---

**Шаг 1: Биномиальное распределение**  
**Понятие**: Число успехов в `n` независимых испытаниях с вероятностью `p`.  
**Формула**:  
\[ P(X = k) = C(n, k) \times p^k \times (1 - p)^{n - k} \]  

**Пример**:  
- Вероятность выпадения 3 орлов в 5 бросках:  
  \[ P(X = 3) = C(5, 3) \times 0.5^3 \times 0.5^2 = 10 \times 0.125 \times 0.25 = 0.3125. \]  

**Код**:  
```python
from scipy.stats import binom
n, p = 5, 0.5
print(f"P(X=3): {binom.pmf(3, n, p):.4f}")  # 0.3125
```

**Практика**:  
- Какова вероятность получить 2 шестёрки при 4 бросках кубика? (Ответ: ≈ 0.1157).  

---

**Шаг 2: Распределение Пуассона**  
**Понятие**: Моделирует редкие события (например, число звонков в кол-центр за час).  
**Формула**:  
\[ P(X = k) = \frac{\lambda^k \times e^{-\lambda}}{k!} \]  

**Пример**:  
- Если в магазин в среднем приходит 5 клиентов в час, какова вероятность прихода 3 клиентов?  
  \[ P(X = 3) = \frac{5^3 \times e^{-5}}{3!} ≈ 0.1404. \]  

**Код**:  
```python
from scipy.stats import poisson
lambda_param = 5
print(f"P(X=3): {poisson.pmf(3, lambda_param):.4f}")  # 0.1404
```

**Практика**:  
- Если λ = 2, найдите P(X=0). (Ответ: ≈ 0.1353).  

---

**Шаг 3: Гипергеометрическое распределение**  
**Понятие**: Вероятность выбрать `k` успехов без возвращения.  
**Формула**:  
\[ P(X = k) = \frac{C(K, k) \times C(N-K, n-k)}{C(N, n)} \]  

**Пример**:  
- В колоде 4 туза. Какова вероятность вытащить 2 туза из 5 карт?  
  \[ P(X=2) = \frac{C(4, 2) \times C(48, 3)}{C(52, 5)} ≈ 0.0399. \]  

**Код**:  
```python
from scipy.stats import hypergeom
N, K, n = 52, 4, 5
print(f"P(X=2): {hypergeom.pmf(2, N, K, n):.4f}")  # 0.0399
```

**Практика**:  
- В корзине 10 яблок, 3 гнилых. Какова вероятность выбрать 1 гнилое из 4? (Ответ: ≈ 0.5000).  

---

#### **Урок 2.2: Непрерывные распределения — время, рост и ошибки**  
**Цель**: Понять, как распределены непрерывные величины (например, рост людей).  

---

**Шаг 1: Равномерное распределение**  
**Понятие**: Все значения в интервале [a, b] равновероятны.  
**Формула плот